orderPricePlan/templates/responses/Recharge.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ars="http://www.huawei.com/bme/cbsinterface/arservices" xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon" xmlns:arc="http://cbs.huawei.com/ar/wsservice/arcommon">
   <soapenv:Header/>
   <soapenv:Body>
      <ars:RechargeRequestMsg>
         <RequestHeader>
            <cbs:Version>1</cbs:Version>
            <cbs:BusinessCode>?</cbs:BusinessCode>
            <cbs:MessageSeq>${=new java.text.SimpleDateFormat("yyyy-MM-dd'T'HH:mm:ss.SSS").format(new Date())}</cbs:MessageSeq>
            <cbs:AccessSecurity>
               <cbs:LoginSystemCode>102</cbs:LoginSystemCode>
               <cbs:Password>7/PuyYwNpRtSX7jDpxnl2ECAvuVYH2Mu9zxqgPGJrPYYK73MCZN7DvrDepA=</cbs:Password>
            </cbs:AccessSecurity>
            <cbs:OperatorInfo>
               <cbs:OperatorID>101</cbs:OperatorID>
            </cbs:OperatorInfo>
         </RequestHeader>
         <RechargeRequest>
            <ars:RechargeObj>
               <ars:SubAccessCode>
                  <arc:PrimaryIdentity>9210459742</arc:PrimaryIdentity>
               </ars:SubAccessCode>
            </ars:RechargeObj>
            <ars:RechargeInfo>
               <ars:CashPayment>
                  <ars:PaymentMethod>1001</ars:PaymentMethod>
                  <ars:Amount>1400</ars:Amount>
                  <ars:BankInfo>
                     <arc:BankCode>ABC</arc:BankCode>
                  </ars:BankInfo>
               </ars:CashPayment>
            </ars:RechargeInfo>
            <ars:AdditionalProperty>
               <arc:Code>CN_AU</arc:Code>
               <arc:Value>20240919</arc:Value>
            </ars:AdditionalProperty>
            <ars:AdditionalProperty>
               <arc:Code>CN_CHARGE_TYPE</arc:Code>
               <arc:Value>20240919</arc:Value>
            </ars:AdditionalProperty>
            <ars:AdditionalProperty>
               <arc:Code>CN_CALLER_ID</arc:Code>
               <arc:Value>caller20240919</arc:Value>
            </ars:AdditionalProperty>
            <ars:AdditionalProperty>
               <arc:Code>CN_VC_TYPE</arc:Code>
               <arc:Value>type20240919</arc:Value>
            </ars:AdditionalProperty>
            <ars:AdditionalProperty>
               <arc:Code>C_CELLID</arc:Code>
               <arc:Value>cell20240919</arc:Value>
            </ars:AdditionalProperty>
            <ars:AdditionalProperty>
               <arc:Code>CN_VC_SN</arc:Code>
               <arc:Value>sn20240919</arc:Value>
            </ars:AdditionalProperty>
         </RechargeRequest>
      </ars:RechargeRequestMsg>
   </soapenv:Body>
</soapenv:Envelope>